/*******************************************************************************************************
/* 보석가게에 도둑이 들었습니다. 도둑은 최대 W만큼 무게의 보석을 들고 갈 수 있습니다. 무게
가 wi이고 가치가 vi인 보석이 종류별로 한 개씩 있을 때, 도둑이 가져갈 수 있는 보석들의 가
치 합의 최댓값을 구하는 프로그램을 작성하세요.

입력은, 첫줄에 테스트케이스의 개수
두 번째 줄에 보석의 종류 n(1 ≤ n ≤ 100)과 도둑이 들고 갈 수 있는 최대 무게 W(1 ≤ W ≤10000)가 주어집니다.
세 번째 줄부터 n+1번째 줄까지 보석의 무게 wi(1 ≤ wi ≤ 1000)와 가치vi(1 ≤ vi ≤ 1000)가 순서대로 주어집니다.
주어지는 입력 값은 모두 자연수입니다.
출력은, 각 테스트케이스에 대해서 보석들의 가치 합의 최댓값을 출력합니다                                                                     */
/********************************************************************************************************/


int main()
{
	return 0;
}